[
  {
    "transcript_chunk": "AI ads. It's something I've talked about a little bit. A couple months ago, even made a video on the AI dog ads that everyone's getting served. We ended up ordering a couple. Of course, didn't resemble anything even close to what the ads were claiming because obviously it was never going to. The ads were fake. And unsurprisingly, the problem has only gotten worse. I am now inundated with AI ads and it's been basically sweeping through like a plague. AI ads are the new wave usually to sell products that are just drop-shipped alley express garbage. But they use AI ads to try and sell the consumer on a fantasy that just isn't real. A big one going on right now is Pandy. That's become like the new AI dog. It's an AI plush panda, a pocket panda basically. There's a YouTuber who just made a video covering the whole thing. I'll just go ahead and play a couple clips from that. But this isn't the main one I want to focus on. This is just another example of it. You know the one looks like a cute little panda moving like a real animal, but it's actually a robot. So you don't have to feed it, clean up after it, or worry about it. And hey, if it's on Facebook and YouTube, it must be legit, right? The photos of the toy look different from the one in the ad. Scroll further, and they have celebrity posts from Twitter, but they're just static images, no links to actual accounts. And if you reverse image, search them, surprise. They show up on other scammy toy websites selling the exact same thing under different names, advanced AI plush for $29.99. And if you take one of the more realistic images and run it through an image search, you can find the exact same plush on AliExpress for anywhere from $1 to $10. This is the new big scam. This is the hotness, the meta. They take a very cheap dog shit product from AliExpress or wherever else. And then they make an AI commercial for it, where it has all of this footage that obviously isn't real and the toy doesn't actually do, but it's convincing enough to some people that aren't paying enough attention or just don't know AI. I hate commercials exist. These have been very effective, pretty successful from everything I've been able to tell. Because just imagine you're like in your late 60s, your scroll on Facebook, reading about 5G blasts in your nut sack with alien juices, but then all of a sudden the pande ad plays, you're like, oh, that's cute. Maybe my grandkids would like it and they make a purchase. And then what shows up is basically the shit that you get at the kiosk in the mall in the late 90s. It's nothing impressive, but it's very smart, deceptive marketing tactics, and they are everywhere. It doesn't seem like there's like a real vetting process for the advertisements that play on most major websites. So they are getting swarmed by AI ads right now. And the one that Matt just put on my radar is one called Bakers Seaman Booster or something like that. Seaman X, fucking weapon X of seaman enhancement. And their big marketing push right now is AI generated ads for it. Also, there's like five different websites that get tied to it somehow. I've been all over the place. And when Matt told me about it today and showed me one of the ads, I came home and immediately got served one as well. So like I must have been listening, fucking Bakers, they've tapped into the main frame here. But yeah, it is a it's a pill that improves your seed volume as well as a flavor booster. So they've cooked up the Manhattan project of nut and they're making AI pushes. Let me go ahead and show you one. Apparently, this is the one that's been running all over Reddit. Ad so good. I ordered 12 bottles. I was losing money not spending it on Bakers Seaman Booster. It's just such a baffling ad. So it's AI women here as well as an AI voiceover that just says Bakers and then like some moaning. But like the sound effects that they have playing, which I guess are supposed to be like dripping sperm. It just sounds like piss. It's just actual peepee droplets. It's like that's not like that doesn't you don't hear that sound and immediately think of like Seaman. You hear that and you think someone is taking a leak. But maybe that's the whole thing. Like you ordered Bakers and it turns your your Seaman into into piss like Jesus turning water to wine. This right here is the ad that's playing on a bunch of YouTube videos. It's good better Bakers and it's an AI image of a woman who's wearing more and more pearl necklaces as it approaches Baker. And then you go to one of their websites and it's a bunch of mumbo jumbo on here and then towards the bottom they start once again leaning on AI to generate images and then just slap Bakers on top of it. So it's very clear that their whole marketing is just using AI to somehow deceive people into buying the Seaman and flavor booster for their nut. Then on another one of their sites it's all more AI images but this time it's all baking and frost.",
    "summary": "In the first 5 minutes, CNN's John Sutter has been inundated with fake AI ads. The new wave usually to sell products that are just drop-shipped alley express garbage. They use AI ads to try and sell the consumer on a fantasy that just isn't real."
  },
  {
    "transcript_chunk": "related, which is a very subtle wink and nod to the consumer. This section actually had me giggle right here though, the Baker's Flavor Boost. It then goes in about like pineapple juice and how like the Baker's formula adds pineapple, stem, extract to enhance your flavor. It's just so shameless. It's so unbelievably shameless. All their Amazon listings are also super suspicious. There's no reviews on any of them and all of them also have AI-generated images. So this like entire section is nothing but images like this. Now I have no idea what's actually in these pills. It could be anything. You could be buying fucking plutonium tablets or something. I have no idea. This should be rock-rude oil in there. I don't know. All I know is that whatever is in there, I can promise you the AI ads are not convincing me it's something worth purchasing. If I see an AI advertisement for a product, the immediate assumption and it is the correct assumption to make is that the product is fraudulent. It is a scam and it is somewhat dangerous. It's got to be because wilds would you be making fake advertisements for it. We're seeing this becoming more and more common. It's been big with toys like with the AI dog and the pendant stuff. I think the reason is obvious because it targets a very huge market, which is kids as well as parents that are maybe shopping for their kids. So if this floats across there, they're likely to see this and be like, wow, that's really impressive and it's really cheap for that kind of tech. I'll buy it. Meanwhile, what they're actually buying is like a $1 Alley Baba Drop-Shipped piece of garbage. It's very, very effective. And now it's not just exclusive to toys. Now it's infiltrated supplements and things trying to parade themselves around as health supplements and benefits that kind of thing. Using fake people, fake advertisement, all AI generated in order to try and sell you on it, being something that you should buy for your own health. It is very concerning this direction that it's all heading. I'm going to say it. I'm going to be real brave. I think AI marketing should be illegal. I think it is deceptive and fraudulent by its very nature because it's not real. If your product can do all the things your AI ad is claiming, it shouldn't need AI to show it doing those things. It should be able to do them in the real world, real life. And you should be able to put that in your ad, the real thing, not some AI rendition of it as with the dog, as with the panda. The actual product you buy does not do any of those things that the ad is showing it doing. Thus, it is by its textbook definition, a misleading ad. It is scamming you. I really think there needs to be a crackdown on AI advertising. It's a very concerning direction that all of this is heading. So like with this baker's turbo, Wombo, volume booster and flavor enhancer, like having AI ads to show you these things is so weird. It's just so fucking peculiar. Again, it makes me not trusted. I don't know anything about this brand or anything. I think it's weird that they have multiple different websites. It's all in slightly different variations, but all of which use AI on there. I think that's very odd. And I think them using AI to try and sell you on it should be something that raises big red flags as like this not being a trustworthy brand. Anyway, just wanted to app about this a little bit. That's it.",
    "summary": "In the 5-10 minutes, CNN's John Sutter says he thinks AI marketing should be illegal. He says it is deceptive and fraudulent by its very nature because it's not real. Sutter: There needs to be a crackdown on AI advertising."
  }
]